// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Введите число: ");

// int num = int.Parse(Console.ReadLine());

// // Вводим массив числа num.

// int a = 1;

// // Обозначаем переменную a.

// while (a <= num)
// {
//     if (a % 2 == 0)
//     {
//         Console.Write(a + " ");
//     }
//     a++;
// }

// Создаем цикл. Вводим условие четности и выводим результат.


// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// int a;

// Console.WriteLine("Entr num a");

// a = Convert.ToInt32(Console.ReadLine());

// int b;

// Console.WriteLine("Entr num b");

// b = Convert.ToInt32(Console.ReadLine());

// int c;

// Console.WriteLine("Entr num c");

// c = Convert.ToInt32(Console.ReadLine());

// // Обозначаем три переменные a,b и c.

// // int max = 0;

// // Обозначаем переменную max.

// if (a > max ) max = a;
// if (b > max ) max = b;
// if (c > max ) max = c;

// // Обозначаем условие.

// Console.Write("max = ");
// Console.WriteLine(max);

// // Выводим результат. 

// // Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// int a;

// Console.WriteLine("Entr num a");

// a = Convert.ToInt32(Console.ReadLine());

// // Обозначаем переменную а.

// if (a % 2 == 0){
//         Console.WriteLine("Вашу число является четным числом");
// }
// if (a % 2 != 0){
//     Console.WriteLine("Ваше число не является четным числом");
// }

// Обозначаем условие четности и нечетности числа а и выводим результат.

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Введите число: ");

// int num = int.Parse(Console.ReadLine());

// // Вводим массив числа num.

// int a = 1;

// // Обозначаем переменную a.

// while (a <= num)
// {
//     if (a % 2 == 0)
//     {
//         Console.Write(a + " ");
//     }
//     a++;
// }

// // Создаем цикл. Вводим условие четности и выводим результат.
